---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetGlobal2DOriginHandle
source: html/3c8b70b1-7e86-3c06-8f9c-87d73b50b89c.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetGlobal2DOriginHandle Method

Obtains the handle representing the 2D origin.

## Syntax (C#)
```csharp
public static IFCAnyHandle GetGlobal2DOriginHandle()
```

## Returns
The handle.